<?php


return [
    'charge' => [
        'key'=>"charge",
        'title'=>"Nạp thẻ tự động",
        'status' => [
            '1' => 'Thẻ đúng',
            '0' => 'Thẻ sai',
            '2' => 'Chờ xử lý',
            '3' => 'Sai mệnh giá',
            '999' => 'Lỗi nạp thẻ',
            '-999' => 'Lỗi nạp thẻ',
            '-1' => 'Phát sinh lỗi nạp thẻ',
        ],
        'status-callback' => [
            '0' => 'Thẻ sai',
            '10000' => '10,000đ',
            '20000' => '20,000đ',
            '30000' => '30,000đ',
            '50000' => '50,000đ',
            '100000' => '100,000đ',
            '200000' => '200,000đ',
            '300000' => '300,000đ',
            '500000' => '500,000đ',
            '1000000' => '1,000,000đ',
            '2000000' => '2,000,000đ',
            '5000000' => '5,000,000đ',
        ],

        'key_encrypt' => env('ENCRYPT_CHARGING'),
        'gate_id' => [
            '6' => 'NTN (with Callback)',
            '8' => 'CCC (with Callback)',
        ],


    ],
];
